{
"Oh crumpets, there’s this crazy problem.":"G. Bailey",
"Non sequitur: \"Why do you call liquid petrol gas??\"":"G. Bailey",
"When computers start running the world… or are they already?":"G. Bailey",
"I can go progressively more slowly until people scream out of boredom, or I can go progressively faster until people scream out of fear.":"G. Bailey",
"In Python you can have something be an integer and then three lines later it can be a sausage.":"G. Bailey",
"I can be louder than any machine! Well, not any machine, but pretty well any machine.":"G. Bailey",
"It throws a fit— oh sorry, an exception…":"G. Bailey",
"Here’s a puzzle from a person named Sam who couldn’t spell his last name correctly.":"G. Bailey",
"There’s a fundamental theorem of mathematics that says the quality of your mathematics depends on the quantity of your caffeine. Or maybe it’s the quantity of mathematics and the quality of your caffeine…":"G. Bailey",
"Oh, you’re going to be like that to me?? HMM??":"G. Bailey, to his computer",
"DIE.":"G. Bailey, to his computer",
"Do something simple, see if the computer’s going to like you today. If it does, carry on.":"G. Bailey",
"The local variable may not have been initialized! But I can look at that program and see that it jolly well has been initialized! Silly machine.":"G. Bailey",
"The value of 3 to the power 50 is minus— Well, it’s a computer, it must be right.":"G. Bailey",
"Methought I was… but no man can tell what methought I was, methought I was an ass!":"G. Bailey quoting \"A Midsummer Night’s Dream\"",
"Does this remind you of being at the dentist? …It must be really hard to be an elephant there. You gotta get the nose up.":"G. Bailey, in response to loud construction noise",
"ADFHLTYJL! Well, you didn’t quite catch what I said there, did you.":"G. Bailey, explaining Double.NaN",
"This is a really cheap white hat.":"G. Bailey, holding up a folded piece of paper",
"Your hat, sir.":"G. Bailey, handing said paper to a student",
"We need a volunteer to be cheap.":"G. Bailey, as a hand immediately shoots up",
"Tch-tch-tch! You gotta keep pointing! Good grief! This is probably your morning calisthenics!":"G. Bailey",
"There is, however, one sad consequence… no one is pointing to him. No one is pointing there. He is going to be garbage collected.":"G. Bailey",
"Well actually, if you could hand it in on punchcards, that’d be really helpful.":"G. Bailey, in response to a question on how to hand in homework",
"Oh, YOUR homework?? I thought you were talking about MY homework from forty years ago!!":"G. Bailey",
"You are being a swine, dear machine.":"G. Bailey, to his computer",
"This is a new level of dirty rotten sneaky trick.":"G. Bailey",
"…some snazzy-ass function…":"G. Bailey",
"Because it’s a swine.":"G. Bailey, when asked why a compiler did something weird",
"And now we see American democracy in action.":"G. Bailey, in response to people not raising their hands on a \"yes or no\" question",
"What does a computer know about a row or a column? The computer hasn’t the foggiest idea what a row or a column is!!… The rows and columns are entirely in your own imagination!":"G. Bailey",
"Shockingly shoddy chalk today.":"G. Bailey",
"Now you do something useful with it, of course. As if anything useful is done with rhubarb, but anyways…":"G. Bailey, talking about an object named \"rhubarb\"",
"I have a pet peeve. I know it seems very surprising that I’d be opinionated…":"G. Bailey",
"Oh dear, this is a course and I want you to think! Oh dear.":"G. Bailey",
"Bless you! Must be allergic to characters.":"G. Bailey, in response to a student sneezing",
"I am, of course, of limited stature…":"G. Bailey",
"Of course, there was one point where I taught on rollerblades.":"G. Bailey",
"But that was going to be fun…":"G. Bailey, deprived of the chance to teach while standing on a chair",
"If I was sensible, I would make sure that this was not a one-seater car. I am not going to be sensible.":"G. Bailey",
"Life is never good. Unless you assume every day is going to be bad, then life is okay.":"G. Bailey",
"I could put the entire world population in that car! Of course, there are countries where it approaches that, but you can see that it doesn’t really work.":"G. Bailey",
"At least you can have a conversation with a person. Having a conversation with a String gets very boring.":"G. Bailey",
"Oh yeah, you have some sort of weird celebration on Saturday.":"G. Bailey",
"Well if you think about it, it was really just a little contretemps between England and France. We got tired of mussing up each other’s countries, so we decided to muss up somewhere else.":"G. Bailey, on the American Revolution",
"The quiz will be on paper, yes. Working on doing ESP, but there’s some interference patterns going on.":"G. Bailey",
"I can lock down the internet access, then you can get round it by tethering to your phone. Then I can lock down the phone access, and you lot will find a way to get round that, and if you can do that you should probably be passing the course anyway.":"G. Bailey",
"Not to say that you ever, or I ever, will try to set one parent against another…":"G. Bailey, talking about inheritance",
"OH, THE DENTISTS ARE BACK! JOLLY GOOD!":"G. Bailey, in response to construction noise",
"What, you’re not going to make life easy for me?? Oh, you wretched annoying animal.":"G. Bailey, to his computer",
"Feeeehh…raaa….":"G. Bailey, trying to spell Ferrari (Ferarri? —> Fereari? —> Ferarri? —> Ferrari)",
"What a nice example. It’s almost as if I deliberately arranged things this way…":"G. Bailey",
"Oh, golly! I’ve run out of time! You’re going to have to wait for the sequel.":"G. Bailey",
"How many people would like it if I went faster? …Slower? …How many people feel it’s about the right speed for you guys? …I’ll try and do all three.":"G. Bailey",
"It’s also dreadfully polite, and therefore highly civilized.":"G. Bailey, talking about a class he just created",
"And so we tend to call these irritators— I mean iterators!":"G. Bailey",
"Their VIP level, their pomposity level, whatever you want to call it.":"G. Bailey",
"I’m going to pretend to be a computer scientist rather than someone who has any knowledge of the English language and so just misuse the language.":"G. Bailey",
"You fathead!":"G. Bailey, talking to himself",
"You gave them a present! They had the fun of opening it! …And the fun of the chase afterward.":"G. Bailey, on giving someone a carefully wrapped empty box as a present",
"I used to say, mathematicians make definitions! I define my jokes to be funny! I also make the grade! Therefore, you laugh! But I thought that was a little tacky.":"G. Bailey",
"Along comes Peter! Along comes Quince!":"G. Bailey, making more Midsummer Night’s Dream references",
"Oh, golly! This is exciting!":"G. Bailey, discussing number theory and recursion",
"And then I’m going to be the most nauseating of picky fussy NYAAAHH pedantic sausages…":"G. Bailey, going through an inductive proof",
"I DID THE BASE CASE!! THERE’S NOTHING WRONG WITH THE BASE CASE!! WHY DON’T WE TRY A BASE CASE OF AN EMPTY SET AND SEE IF THAT WORKS!!":"G. Bailey, with crazy eyes and arms flapping, after proving that all people in the world have the same height (PS: the proof’s flaw was in the base case)",
"If I were going to be kind and pleasant and whatever else… which is of course quite unusual for me…":"G. Bailey",
"Woooooow! Java is going bonkers up there!":"G. Bailey",
"CPU, though! Wow, we’re having fun down there! CPU alone is kind of emphatic.":"G. Bailey, gleefully fucking with his computer",
"So in one swell foop…":"G. Bailey",
"I believe that twenty is quite a bit smaller than half a million. You can disagree with me, I’ll give you twenty dollars and you can give me half a million.":"G. Bailey",
"If my dog eats your homework…which is tricky because I don’t have a dog…":"G. Bailey",
"We’ve got three weeks to cover all of artificial intelligence. That’s ample. After all, it’s supposed to be ARTIFICIAL intelligence.":"G. Bailey",
"Along comes r, who is a famous pirate…":"G. Bailey naming variables",
"There is nothing universal one can say about computer science! Except for the thing I just said.":"G. Bailey",
"Driving on the left is being civilized. Driving on the right is being anti-civilized. You guys just don’t know your history. In the olden days…":"G. Bailey",
"You have just lopped the head off your companion— which is not a very gracious thing to do— in order to defend them.":"G. Bailey",
"So mathematics is basically political.":"G. Bailey",
"You mean you didn’t get it from me waving my hands in the air?? Oh dear.":"G. Bailey",
"There’s left, and there’s not quite left, and there’s sort of middling, and there’s not quite so middling but with a right influence…It smells like politics.":"G. Bailey",
"Woooooow! Real pocket money! …Depending on your choice of currency.":"G. Bailey",
"Doing homework with multithreaded processes is a pain in the neck and essentially demoralizing.":"G. Bailey",
"I didn’t use it! Oh, you silly twit.":"G. Bailey, either to himself or his computer (not clear which)",
"You mean you want it to actually do something?? Wow, gosh, fussy fellow.":"G. Bailey, in response to a student question",
"TRY IT! TRY IT! TRY IT! TRY IT! TRY IT! TRY IT! TRY IT!":"G. Bailey barking at a randomly selected student",
"Thanks for being useful.":"G. Bailey, to the aforementioned randomly selected student",
"Come on, you… wakey wakey…":"G. Bailey, to his computer",
"It looks and smells like a window. It’s not a window. It’s morally a window.":"G. Bailey, on JFrames",
"Consider yourself annoyed enough. Don’t start annoying other people.":"G. Bailey",
"Swing is just like the rest of Java: Beautifully overly organized.":"G. Bailey",
"Try not to annoy people who might do bad things to you when they get annoyed. End of official warning.":"G. Bailey",
"-40 Celsius is -40 Fahrenheit. That’s jolly cold. Alaska-type cold.":"G. Bailey",
"And that fantastic piece of dynamic art, worthy of… not very much…":"G. Bailey",
"Ahhh, isn’t that nice. We have a little magenta hollow diamond. That’s so exciting I’m going to do it again!":"G. Bailey, playing with GUIs",
"The bottom note on most pianos is an A. The bottom note on mine is a C, but that’s just weird.":"G. Bailey",
"Oh, how do you make the animation? Magic! Next question.":"G. Bailey",
"Sorry, I’m not very good at singing two notes at the same time. The argument is whether I’m good at singing one note at the same time.":"G. Bailey",
"What does that fraction look like when n is equal to 62? Okay, clearly you’re not very good at mental arithmetic. What does that fraction look like when n is equal to the national debt of choose-your-favorite-country?":"G. Bailey",
"When life gets bad, things get bad at a quadratic speed.":"G. Bailey",
"You can ask Doctor Who about that one.":"G. Bailey",
"I do acknowledge that there are religious differences when it comes to that. Some people swear by, while other people swear at, quick sort.":"G. Bailey",
"Bucket sort, which I rather like… it reminds me of how tea used to be served on British railway trains.":"G. Bailey",
"So yes, this is a standard way of representing the data, but you’re a twit if you use it.":"G. Bailey",
"I think the lecture’s going to be really short because the humidity is so high that the chalk is collapsing every time I write.":"G. Bailey",
"And I see loads of people nodding their heads. The nodding of heads means you guys are asleep again!":"G. Bailey, making fun of his class full of dumbasses",
"But do you want the ring to be organized from most recent or most ancient? I mean obviously if it’s the Tolkien one, it should be from most ancient.":"G. Bailey",
"Maybe we need to have compulsory calisthenics for you people, to wake you guys up. What WERE you guys doing this weekend? Obviously taking in the warm, sultry weather.":"G. Bailey",
"How many of you have seen minimum spanning trees before? …Nobody? Oh, WHOOPEE! I get a chance to manipulate unclouded minds!":"G. Bailey",
"It’s all to do with megalomaniacs.":"G. Bailey, explaining minimum spanning trees",
"I’m actually going to do an example because I want to pretend that this is relevant to real life and all that.":"G. Bailey",
"If we’re going to be doing empires I’m going to use empire-sized chalk.":"G. Bailey",
"I can’t do that because that would make a cycle! BAAAAAAAD. Not a tree.":"G. Bailey",
"There will be questions on the exam, and you will be called upon to provide answers to them.":"G. Bailey, explaining how the final exam will work",
"Just in case people were wondering, that was a slight application of British sarcasm.":"G. Bailey",
"This is called reverse Polish notation. It is not a reflection on the Polish, or on any reverses.":"G. Bailey, After that, he started teaching in a Polish accent for a few minutes."

}
